---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ToposolidSubdivideHeignt
source: html/30c1b9cd-5def-1351-ad71-e255c2a1e450.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ToposolidSubdivideHeignt Property

"Sub-divide Height"

## Syntax (C#)
```csharp
public static ForgeTypeId ToposolidSubdivideHeignt { get; }
```